NXP-MCU-X-Lab/dm-mcxa-encoder/source/app_encoder_runtime.c
#include "app_encoder_runtime.h"

#include <math.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>

#include "fsl_common.h"
#include "fsl_device_registers.h"

#include "app_encoder_storage.h"
#include "app_freemaster.h"
#include "app_tformat.h"

#define ZERO_AVERAGE_SAMPLES      (64U)
#define CAL_SAMPLE_RATE_HZ        (1000U)
#define CAL_SAMPLE_DECIMATION     (ADC_SAMPLE_RATE_HZ / CAL_SAMPLE_RATE_HZ)
#define STATIONARY_WINDOW_COUNTS  (16U)
#define STATIONARY_SAMPLES        (ADC_SAMPLE_RATE_HZ / 2U)
#define ENCODER_AUTOSAVE_MIN_SOLVES       (8U)
#define ENCODER_AUTOSAVE_CENTER_COUNTS    (16.0f)
#define ENCODER_AUTOSAVE_GAIN_DELTA       (0.01f)

#if ((ADC_SAMPLE_RATE_HZ % CAL_SAMPLE_RATE_HZ) != 0U)
#error "ADC_SAMPLE_RATE_HZ must be an integer multiple of CAL_SAMPLE_RATE_HZ"
#endif

#define CAPTURE_MODE_NONE    (0U)
#define CAPTURE_MODE_ZERO    (1U)
#define CAPTURE_MODE_FACTORY (2U)

#define ZERO_ORIGIN_NONE    (0U)
#define ZERO_ORIGIN_FM      (1U)
#define ZERO_ORIGIN_TFORMAT (2U)

#define SAVE_PENDING_NONE    (0U)
#define SAVE_PENDING_ZERO    (1U)
#define SAVE_PENDING_FACTORY (2U)

typedef enum _storage_result
{
    STORAGE_RESULT_DEFERRED,
    STORAGE_RESULT_SAVED,
    STORAGE_RESULT_FAILED
} storage_result_t;

typedef struct _zero_accumulator
{
    uint32_t a1_sin_sum;
    uint32_t a1_cos_sum;
    uint32_t a2_sin_sum;
    uint32_t a2_cos_sum;
} zero_accumulator_t;

extern uint32_t SystemCoreClock;

encoder_result_t encoder_result;
adc_sample_result_t adc_result;
volatile uint32_t adc_sample_count;
volatile uint32_t adc_overrun_count;
volatile uint32_t encoder_calibration_source;
volatile uint32_t encoder_perf_process_max;
volatile uint32_t encoder_perf_isr_max;
volatile uint32_t encoder_perf_core_clock_hz;

static encoder_calibration_t s_factory_calibration;
static encoder_cal_quality_t s_saved_quality;
static encoder_state_t s_encoder_state;
static encoder_runtime_trim_t s_runtime_trim;
static uint32_t s_app_status_flags;
static bool s_has_persistent_config;
static bool s_autosave_done;

static volatile encoder_result_t s_realtime_encoder_result;
static volatile uint8_t s_realtime_encoder_ready;
static volatile uint32_t s_realtime_sequence;
static uint32_t s_published_sequence;

static volatile uint8_t s_capture_mode;
static volatile uint8_t s_capture_done;
static volatile uint8_t s_capture_pending;
static volatile uint32_t s_capture_count;
static volatile uint32_t s_capture_decimation;
static volatile encoder_raw_sample_t s_capture_sample;
static zero_accumulator_t s_zero_accumulator;
static encoder_cal_stats_t s_factory_stats;
static encoder_raw_sample_t s_factory_zero_sample;
static uint8_t s_zero_origin;

static uint8_t s_save_pending;
static bool s_erase_pending;
static encoder_calibration_t s_pending_calibration;
static encoder_cal_quality_t s_pending_quality;
static uint32_t s_deferred_tformat_resets;

static uint32_t s_stationary_anchor;
static uint32_t s_stationary_count;
static bool s_stationary_tracking;

static void perf_dwt_init(void)
{
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
    encoder_perf_core_clock_hz = SystemCoreClock;
}

static encoder_raw_sample_t adc_to_encoder_sample(const adc_sample_result_t *sample)
{
    encoder_raw_sample_t result;

    result.a1_sin_raw = sample->a1_sin_raw;
    result.a1_cos_raw = sample->a1_cos_raw;
    result.a2_sin_raw = sample->a2_sin_raw;
    result.a2_cos_raw = sample->a2_cos_raw;
    return result;
}

static int32_t wrapped_count_delta(uint32_t value, uint32_t reference)
{
    int32_t delta = (int32_t)value - (int32_t)reference;

    if (delta > ((int32_t)ENCODER_COUNTS_PER_REV / 2))
    {
        delta -= (int32_t)ENCODER_COUNTS_PER_REV;
    }
    else if (delta < -((int32_t)ENCODER_COUNTS_PER_REV / 2))
    {
        delta += (int32_t)ENCODER_COUNTS_PER_REV;
    }
    return delta;
}

static void update_stationary_state(const encoder_result_t *result)
{
    int32_t delta;

    if ((result->status & ENCODER_STATUS_POSITION_INVALID_MASK) != 0U)
    {
        s_stationary_tracking = false;
        s_stationary_count = 0U;
        fm_encoder_stationary = 0U;
        return;
    }

    if (!s_stationary_tracking)
    {
        s_stationary_anchor = result->angle_counts;
        s_stationary_count = 1U;
        s_stationary_tracking = true;
        fm_encoder_stationary = 0U;
        return;
    }

    delta = wrapped_count_delta(result->angle_counts, s_stationary_anchor);
    if ((delta > (int32_t)STATIONARY_WINDOW_COUNTS) ||
        (delta < -(int32_t)STATIONARY_WINDOW_COUNTS))
    {
        s_stationary_anchor = result->angle_counts;
        s_stationary_count = 1U;
        fm_encoder_stationary = 0U;
        return;
    }

    if (s_stationary_count < STATIONARY_SAMPLES)
    {
        s_stationary_count++;
    }
    fm_encoder_stationary = (s_stationary_count >= STATIONARY_SAMPLES) ? 1U : 0U;
}

static bool capture_decimation_ready(void)
{
    if (s_capture_mode != CAPTURE_MODE_FACTORY)
    {
        return true;
    }

    s_capture_decimation++;
    if (s_capture_decimation < CAL_SAMPLE_DECIMATION)
    {
        return false;
    }
    s_capture_decimation = 0U;
    return true;
}

static void capture_sample_from_isr(const encoder_raw_sample_t *sample)
{
    if ((s_capture_mode == CAPTURE_MODE_NONE) || (s_capture_done != 0U) ||
        (s_capture_pending != 0U) || !capture_decimation_ready())
    {
        return;
    }
    s_capture_sample = *sample;
    s_capture_pending = 1U;
}

static void encoder_sample_callback(const adc_sample_result_t *sample)
{
    const encoder_raw_sample_t encoder_sample = adc_to_encoder_sample(sample);
    encoder_calibration_t effective_calibration;
    encoder_result_t next_result;
    uint32_t isr_start;
    uint32_t process_start;
    uint32_t process_cycles;
    uint32_t isr_cycles;
    bool ready;

    adc_result = *sample;
    isr_start = DWT->CYCCNT;
    encoder_runtime_trim_apply(&s_factory_calibration, &s_runtime_trim, &effective_calibration);

