NXP-MCU-X-Lab/dm-mcxa-encoder/source/app_encoder_runtime.c
    process_start = DWT->CYCCNT;
    encoder_process(&s_encoder_state, &effective_calibration, &encoder_sample, &next_result, NULL);
    process_cycles = DWT->CYCCNT - process_start;

    encoder_runtime_trim_update(&s_runtime_trim,
                                &s_factory_calibration,
                                &encoder_sample,
                                &next_result);
    next_result.status |= s_app_status_flags;
    ready = s_has_persistent_config || s_runtime_trim.has_locked;
    update_stationary_state(&next_result);

    s_realtime_encoder_result = next_result;
    s_realtime_encoder_ready = ready ? 1U : 0U;
    s_realtime_sequence++;
    TFormat_Publish(&next_result, ready);
    capture_sample_from_isr(&encoder_sample);

    isr_cycles = DWT->CYCCNT - isr_start;
    if (process_cycles > encoder_perf_process_max)
    {
        encoder_perf_process_max = process_cycles;
    }
    if (isr_cycles > encoder_perf_isr_max)
    {
        encoder_perf_isr_max = isr_cycles;
    }
}

static void publish_realtime_snapshot(void)
{
    const uint32_t irq_mask = DisableGlobalIRQ();

    if (s_published_sequence != s_realtime_sequence)
    {
        encoder_result = s_realtime_encoder_result;
        fm_encoder_ready = s_realtime_encoder_ready;
        s_published_sequence = s_realtime_sequence;
    }
    adc_sample_count = adc_get_sample_count();
    adc_overrun_count = adc_get_overrun_count();
    EnableGlobalIRQ(irq_mask);
}

static bool capture_is_idle(void)
{
    return s_capture_mode == CAPTURE_MODE_NONE;
}

static void capture_reset(uint8_t mode)
{
    const uint32_t irq_mask = DisableGlobalIRQ();

    s_capture_count = 0U;
    s_capture_decimation = 0U;
    s_capture_done = 0U;
    s_capture_pending = 0U;
    s_capture_mode = mode;
    EnableGlobalIRQ(irq_mask);
}

static void start_zero_capture(uint8_t origin)
{
    memset(&s_zero_accumulator, 0, sizeof(s_zero_accumulator));
    s_zero_origin = origin;
    capture_reset(CAPTURE_MODE_ZERO);
}

static void start_factory_calibration(void)
{
    const uint32_t irq_mask = DisableGlobalIRQ();

    encoder_cal_stats_init(&s_factory_stats);
    memset(&s_factory_zero_sample, 0, sizeof(s_factory_zero_sample));
    s_runtime_trim.enabled = false;
    encoder_runtime_trim_reset(&s_runtime_trim);
    EnableGlobalIRQ(irq_mask);

    encoder_calibration_source = ENCODER_CAL_SOURCE_FACTORY_PENDING;
    fm_factory_cal_progress = 0U;
    capture_reset(CAPTURE_MODE_FACTORY);
}

static void consume_capture_sample(void)
{
    encoder_raw_sample_t sample;
    uint8_t mode;
    uint32_t irq_mask;

    if ((s_capture_pending == 0U) || (s_capture_done != 0U))
    {
        return;
    }

    irq_mask = DisableGlobalIRQ();
    if ((s_capture_pending == 0U) || (s_capture_done != 0U))
    {
        EnableGlobalIRQ(irq_mask);
        return;
    }
    sample = s_capture_sample;
    mode = s_capture_mode;
    s_capture_pending = 0U;
    EnableGlobalIRQ(irq_mask);

    if (mode == CAPTURE_MODE_ZERO)
    {
        if (fm_encoder_stationary == 0U)
        {
            irq_mask = DisableGlobalIRQ();
            s_capture_mode = CAPTURE_MODE_NONE;
            s_capture_pending = 0U;
            s_capture_done = 0U;
            EnableGlobalIRQ(irq_mask);
            if (s_zero_origin == ZERO_ORIGIN_FM)
            {
                fm_command_state = FM_COMMAND_STATE_ERROR;
                fm_command_status = FM_COMMAND_STATUS_MOVING;
            }
            else
            {
                s_deferred_tformat_resets |= TFORMAT_RESET_POSITION;
            }
            s_zero_origin = ZERO_ORIGIN_NONE;
            return;
        }
        s_zero_accumulator.a1_sin_sum += sample.a1_sin_raw;
        s_zero_accumulator.a1_cos_sum += sample.a1_cos_raw;
        s_zero_accumulator.a2_sin_sum += sample.a2_sin_raw;
        s_zero_accumulator.a2_cos_sum += sample.a2_cos_raw;
        s_capture_count++;
        if (s_capture_count >= ZERO_AVERAGE_SAMPLES)
        {
            s_capture_done = 1U;
        }
    }
    else if (mode == CAPTURE_MODE_FACTORY)
    {
        encoder_cal_stats_accumulate(&s_factory_stats, &sample);
        s_factory_zero_sample = sample;
        s_capture_count++;
        fm_factory_cal_progress = (uint8_t)((s_capture_count * 100U) /
                                            ENCODER_CAL_SAMPLE_COUNT);
        if (s_capture_count >= ENCODER_CAL_SAMPLE_COUNT)
        {
            s_capture_done = 1U;
            fm_factory_cal_progress = 100U;
        }
    }
}

static bool take_zero_sample(encoder_raw_sample_t *sample)
{
    zero_accumulator_t accumulator;
    uint32_t count;
    uint32_t irq_mask;

    if ((s_capture_mode != CAPTURE_MODE_ZERO) || (s_capture_done == 0U))
    {
        return false;
    }

    irq_mask = DisableGlobalIRQ();
    accumulator = s_zero_accumulator;
    count = s_capture_count;
    s_capture_mode = CAPTURE_MODE_NONE;
    s_capture_done = 0U;
    s_capture_pending = 0U;
    EnableGlobalIRQ(irq_mask);

    sample->a1_sin_raw = (uint16_t)((accumulator.a1_sin_sum + count / 2U) / count);
    sample->a1_cos_raw = (uint16_t)((accumulator.a1_cos_sum + count / 2U) / count);
    sample->a2_sin_raw = (uint16_t)((accumulator.a2_sin_sum + count / 2U) / count);
    sample->a2_cos_raw = (uint16_t)((accumulator.a2_cos_sum + count / 2U) / count);
    return true;
}

static bool take_factory_done(void)
{
    uint32_t irq_mask;

    if ((s_capture_mode != CAPTURE_MODE_FACTORY) || (s_capture_done == 0U))
    {
        return false;
    }
    irq_mask = DisableGlobalIRQ();
    s_capture_mode = CAPTURE_MODE_NONE;
    s_capture_done = 0U;
    s_capture_pending = 0U;
    EnableGlobalIRQ(irq_mask);
    return true;
}

static void install_calibration(const encoder_calibration_t *calibration,
                                uint32_t source,
                                uint32_t status_flags,
                                bool reset_state)
{
    const uint32_t irq_mask = DisableGlobalIRQ();

    s_factory_calibration = *calibration;
    s_app_status_flags = status_flags;
    encoder_calibration_source = source;
    s_runtime_trim.enabled = true;
    encoder_runtime_trim_reset(&s_runtime_trim);
    if (reset_state)
    {
        encoder_state_init(&s_encoder_state);
    }
    EnableGlobalIRQ(irq_mask);
}

static void load_startup_configuration(void)
{
    encoder_persistent_config_t config;
    uint8_t empty_eeprom[TFORMAT_EEPROM_SIZE];
    uint32_t sequence;

    if (EncoderStorage_Load(&config, &sequence))
    {
        (void)sequence;
        s_saved_quality = config.quality;
        TFormat_LoadEeprom(config.eeprom);
        s_has_persistent_config = true;
        install_calibration(&config.calibration, ENCODER_CAL_SOURCE_NVM,
                            ENCODER_STATUS_OK, true);
        return;
    }

    memset(empty_eeprom, 0xFF, sizeof(empty_eeprom));
    memset(&s_saved_quality, 0, sizeof(s_saved_quality));
    TFormat_LoadEeprom(empty_eeprom);
    s_has_persistent_config = false;
    encoder_calibration_set_board_defaults(&config.calibration);
    install_calibration(&config.calibration,
                        ENCODER_CAL_SOURCE_DEFAULT,
                        ENCODER_STATUS_CAL_STORAGE_INVALID |
                            ENCODER_STATUS_FACTORY_CAL_REQUIRED,
                        true);
}

static void build_persistent_config(const encoder_calibration_t *calibration,
                                    const encoder_cal_quality_t *quality,
                                    encoder_persistent_config_t *config)
{
    config->calibration = *calibration;
    config->quality = *quality;
    TFormat_CopyEeprom(config->eeprom);
}

static storage_result_t save_configuration(const encoder_calibration_t *calibration,
                                           const encoder_cal_quality_t *quality)
{
    encoder_persistent_config_t config;
    bool saved;

