NXP-MCU-X-Lab/dm-mcxa-encoder/source/app_encoder_runtime.c
    if (!TFormat_StorageBegin())
    {
        return STORAGE_RESULT_DEFERRED;
    }
    build_persistent_config(calibration, quality, &config);
    adc_realtime_stop();
    saved = EncoderStorage_Save(&config);
    adc_realtime_start();
    TFormat_StorageEnd();
    return saved ? STORAGE_RESULT_SAVED : STORAGE_RESULT_FAILED;
}

static void finish_zero_if_ready(void)
{
    encoder_raw_sample_t zero_sample;
    encoder_calibration_t calibration;
    uint32_t status = ENCODER_STATUS_OK;

    if (!take_zero_sample(&zero_sample))
    {
        return;
    }

    encoder_runtime_trim_apply(&s_factory_calibration, &s_runtime_trim, &calibration);
    if (!encoder_capture_zero(&calibration, &zero_sample, &status))
    {
        if (s_zero_origin == ZERO_ORIGIN_FM)
        {
            fm_command_state = FM_COMMAND_STATE_ERROR;
            fm_command_status = FM_COMMAND_STATUS_CALIBRATION;
        }
        s_zero_origin = ZERO_ORIGIN_NONE;
        return;
    }

    install_calibration(&calibration,
                        encoder_calibration_source,
                        s_app_status_flags,
                        true);
    s_pending_calibration = calibration;
    s_pending_quality = s_saved_quality;
    s_save_pending = SAVE_PENDING_ZERO;
}

static void finish_factory_if_ready(void)
{
    encoder_calibration_t calibration;
    encoder_state_t state;
    encoder_result_t result;
    encoder_cal_quality_t quality;
    uint32_t status = ENCODER_STATUS_OK;

    if (!take_factory_done())
    {
        return;
    }

    if (!encoder_cal_stats_build(&s_factory_stats, &calibration, &status) ||
        !encoder_capture_zero(&calibration, &s_factory_zero_sample, &status))
    {
        fm_command_state = FM_COMMAND_STATE_ERROR;
        fm_command_status = FM_COMMAND_STATUS_CALIBRATION;
        load_startup_configuration();
        return;
    }

    encoder_state_init(&state);
    encoder_process(&state, &calibration, &s_factory_zero_sample, &result, NULL);
    quality.sample_count = ENCODER_CAL_SAMPLE_COUNT;
    quality.status = result.status;
    quality.mag16 = result.mag16_raw;
    quality.mag15 = result.mag15_raw;

    install_calibration(&calibration,
                        ENCODER_CAL_SOURCE_FACTORY_PENDING,
                        ENCODER_STATUS_OK,
                        true);
    s_pending_calibration = calibration;
    s_pending_quality = quality;
    s_save_pending = SAVE_PENDING_FACTORY;
}

static void complete_pending_save(void)
{
    storage_result_t result;
    bool saved;
    uint8_t save_kind;

    if ((s_save_pending == SAVE_PENDING_NONE) || (fm_encoder_stationary == 0U))
    {
        return;
    }

    save_kind = s_save_pending;
    result = save_configuration(&s_pending_calibration, &s_pending_quality);
    if (result == STORAGE_RESULT_DEFERRED)
    {
        return;
    }
    saved = result == STORAGE_RESULT_SAVED;
    s_save_pending = SAVE_PENDING_NONE;
    if (TFormat_EepromWritePending())
    {
        TFormat_CompleteEepromWrite(saved);
    }

    if (saved)
    {
        s_saved_quality = s_pending_quality;
        s_has_persistent_config = true;
        s_app_status_flags = ENCODER_STATUS_OK;
        encoder_calibration_source = ENCODER_CAL_SOURCE_NVM;
        s_autosave_done = true;
        if ((save_kind == SAVE_PENDING_ZERO) && (s_zero_origin == ZERO_ORIGIN_FM))
        {
            fm_command_state = FM_COMMAND_STATE_DONE;
            fm_command_status = FM_COMMAND_STATUS_OK;
        }
        else if (save_kind == SAVE_PENDING_FACTORY)
        {
            fm_command_state = FM_COMMAND_STATE_DONE;
            fm_command_status = FM_COMMAND_STATUS_OK;
        }
    }
    else if ((save_kind == SAVE_PENDING_FACTORY) ||
             ((save_kind == SAVE_PENDING_ZERO) && (s_zero_origin == ZERO_ORIGIN_FM)))
    {
        fm_command_state = FM_COMMAND_STATE_ERROR;
        fm_command_status = FM_COMMAND_STATUS_STORAGE;
    }
    s_zero_origin = ZERO_ORIGIN_NONE;
}

static void reject_command(uint32_t status)
{
    fm_command_state = FM_COMMAND_STATE_ERROR;
    fm_command_status = status;
}

static void service_freemaster_command(void)
{
    uint8_t command;

    if (fm_command == FM_COMMAND_NONE)
    {
        return;
    }
    command = fm_command;
    fm_command = FM_COMMAND_NONE;

    if ((fm_command_state == FM_COMMAND_STATE_BUSY) || !capture_is_idle() ||
        (s_save_pending != SAVE_PENDING_NONE))
    {
        if (fm_command_state == FM_COMMAND_STATE_BUSY)
        {
            fm_command_status = FM_COMMAND_STATUS_BUSY;
        }
        else
        {
            reject_command(FM_COMMAND_STATUS_BUSY);
        }
        return;
    }

    fm_command_state = FM_COMMAND_STATE_BUSY;
    fm_command_status = FM_COMMAND_STATUS_OK;
    if (command == FM_COMMAND_ZERO_SAVE)
    {
        if (fm_encoder_ready == 0U)
        {
            reject_command(FM_COMMAND_STATUS_NOT_READY);
        }
        else if (fm_encoder_stationary == 0U)
        {
            reject_command(FM_COMMAND_STATUS_MOVING);
        }
        else
        {
            start_zero_capture(ZERO_ORIGIN_FM);
        }
    }
    else if (command == FM_COMMAND_FACTORY_CAL)
    {
        start_factory_calibration();
    }
    else if (command == FM_COMMAND_ERASE_CONFIG)
    {
        if (fm_encoder_stationary == 0U)
        {
            reject_command(FM_COMMAND_STATUS_MOVING);
            return;
        }
        s_erase_pending = true;
    }
    else
    {
        reject_command(FM_COMMAND_STATUS_CALIBRATION);
    }
}

static void service_tformat_resets(void)
{
    s_deferred_tformat_resets |= TFormat_TakeResetRequests();
    s_deferred_tformat_resets &= ~TFORMAT_RESET_ERROR;
    s_deferred_tformat_resets &= ~TFORMAT_RESET_MULTITURN;

    if (((s_deferred_tformat_resets & TFORMAT_RESET_POSITION) != 0U) &&
        (fm_encoder_ready != 0U) && (fm_encoder_stationary != 0U) &&
        capture_is_idle() && (s_save_pending == SAVE_PENDING_NONE) && !s_erase_pending)
    {
        s_deferred_tformat_resets &= ~TFORMAT_RESET_POSITION;
        start_zero_capture(ZERO_ORIGIN_TFORMAT);
    }
}

static float center_drift(const encoder_calibration_t *a,
                          const encoder_calibration_t *b)
{
    const float drift[4] = {
        fabsf(a->a1.center_sin - b->a1.center_sin),
        fabsf(a->a1.center_cos - b->a1.center_cos),
        fabsf(a->a2.center_sin - b->a2.center_sin),
        fabsf(a->a2.center_cos - b->a2.center_cos),
    };
    float worst = drift[0];
    uint32_t i;

    for (i = 1U; i < 4U; i++)
    {
        if (drift[i] > worst)
        {
            worst = drift[i];
        }
    }
    return worst;
}

static float gain_drift(const encoder_calibration_t *a,
                        const encoder_calibration_t *b)
{
    const float drift[4] = {
        fabsf(a->a1.t00 - b->a1.t00) / fabsf(b->a1.t00),
        fabsf(a->a1.t11 - b->a1.t11) / fabsf(b->a1.t11),
        fabsf(a->a2.t00 - b->a2.t00) / fabsf(b->a2.t00),
        fabsf(a->a2.t11 - b->a2.t11) / fabsf(b->a2.t11),
    };
    float worst = drift[0];
    uint32_t i;

    for (i = 1U; i < 4U; i++)
    {
        if (drift[i] > worst)
        {
            worst = drift[i];
        }
    }
    return worst;
}

static void fold_effective_calibration(const encoder_calibration_t *effective)
{
    const uint32_t irq_mask = DisableGlobalIRQ();

