NXP-MCU-X-Lab/dm-mcxa-encoder/source/app_encoder_runtime.c
    s_factory_calibration = *effective;
    encoder_runtime_trim_reset(&s_runtime_trim);
    s_runtime_trim.enabled = true;
    EnableGlobalIRQ(irq_mask);
}

static void service_erase(void)
{
    bool erased;

    if (!s_erase_pending || (fm_encoder_stationary == 0U) ||
        !capture_is_idle() || (s_save_pending != SAVE_PENDING_NONE))
    {
        return;
    }
    if (!TFormat_StorageBegin())
    {
        return;
    }

    adc_realtime_stop();
    erased = EncoderStorage_Erase();
    load_startup_configuration();
    adc_realtime_start();
    TFormat_StorageEnd();
    s_autosave_done = false;
    s_erase_pending = false;
    fm_command_state = erased ? FM_COMMAND_STATE_DONE : FM_COMMAND_STATE_ERROR;
    fm_command_status = erased ? FM_COMMAND_STATUS_OK : FM_COMMAND_STATUS_STORAGE;
}

static void service_eeprom_write(void)
{
    encoder_calibration_t effective;
    encoder_cal_quality_t quality;
    storage_result_t result;
    bool saved;
    uint32_t irq_mask;

    if (!TFormat_EepromWritePending() || s_erase_pending ||
        (s_save_pending != SAVE_PENDING_NONE) ||
        !capture_is_idle() || (fm_encoder_stationary == 0U) ||
        (fm_encoder_ready == 0U))
    {
        return;
    }

    irq_mask = DisableGlobalIRQ();
    encoder_runtime_trim_apply(&s_factory_calibration, &s_runtime_trim, &effective);
    quality = s_saved_quality;
    EnableGlobalIRQ(irq_mask);

    result = save_configuration(&effective, &quality);
    if (result == STORAGE_RESULT_DEFERRED)
    {
        return;
    }
    saved = result == STORAGE_RESULT_SAVED;
    TFormat_CompleteEepromWrite(saved);
    if (saved)
    {
        fold_effective_calibration(&effective);
        s_has_persistent_config = true;
        s_app_status_flags = ENCODER_STATUS_OK;
        encoder_calibration_source = ENCODER_CAL_SOURCE_NVM;
    }
}

static void service_auto_save(void)
{
    encoder_calibration_t effective;
    encoder_cal_quality_t quality;
    uint32_t irq_mask;
    bool locked;
    uint32_t solves;

    if (s_autosave_done || s_erase_pending ||
        (s_save_pending != SAVE_PENDING_NONE) ||
        !capture_is_idle() || (fm_encoder_stationary == 0U) ||
        TFormat_EepromWritePending())
    {
        return;
    }

    irq_mask = DisableGlobalIRQ();
    locked = s_runtime_trim.has_locked;
    solves = s_runtime_trim.solve_count;
    encoder_runtime_trim_apply(&s_factory_calibration, &s_runtime_trim, &effective);
    quality.sample_count = solves;
    quality.status = encoder_result.status;
    quality.mag16 = encoder_result.mag16_raw;
    quality.mag15 = encoder_result.mag15_raw;
    EnableGlobalIRQ(irq_mask);

    if (!locked || (solves < ENCODER_AUTOSAVE_MIN_SOLVES))
    {
        return;
    }

    if (s_has_persistent_config &&
        (center_drift(&effective, &s_factory_calibration) <
         ENCODER_AUTOSAVE_CENTER_COUNTS) &&
        (gain_drift(&effective, &s_factory_calibration) <
         ENCODER_AUTOSAVE_GAIN_DELTA))
    {
        s_autosave_done = true;
        return;
    }

    {
        const storage_result_t result = save_configuration(&effective, &quality);

        if (result == STORAGE_RESULT_DEFERRED)
        {
            return;
        }
        if (result == STORAGE_RESULT_SAVED)
        {
            fold_effective_calibration(&effective);
            s_saved_quality = quality;
            s_has_persistent_config = true;
            s_app_status_flags = ENCODER_STATUS_OK;
            encoder_calibration_source = ENCODER_CAL_SOURCE_NVM;
        }
    }
    s_autosave_done = true;
}

void EncoderApp_Init(void)
{
    perf_dwt_init();
    encoder_runtime_trim_init(&s_runtime_trim);
    load_startup_configuration();

    fm_command = FM_COMMAND_NONE;
    fm_command_state = FM_COMMAND_STATE_IDLE;
    fm_command_status = FM_COMMAND_STATUS_OK;
    fm_factory_cal_progress = 0U;
    fm_encoder_ready = 0U;
    fm_encoder_stationary = 0U;

    adc_set_sample_callback(encoder_sample_callback);
    adc_realtime_start();
}

void EncoderApp_Service(void)
{
    publish_realtime_snapshot();
    consume_capture_sample();
    finish_zero_if_ready();
    finish_factory_if_ready();
    service_freemaster_command();
    service_tformat_resets();
    service_erase();
    complete_pending_save();
    service_eeprom_write();
    service_auto_save();
}
